<template>
  <div>
    <p class="b1 font-bold mb-3">คำแนะนำและข้อจำกัดของเครื่องมือค้นหา</p>
    <p class="b2 mb-3">
      ช่องค้นหาของ ACT Ai ช่วยให้คุณค้นหาข้อมูลเกี่ยวกับโครงการจัดซื้อจัดจ้าง
      หน่วยงานภาครัฐ และผู้รับจ้างที่เกี่ยวข้องได้ง่าย ๆ
      เพียงแค่พิมพ์คีย์เวิร์ดที่ต้องการ เช่น ชื่อโครงการ จังหวัด เลขที่โครงการ
      ชื่อหน่วยงาน ชื่อผู้รับจ้าง หรือเลขทะเบียนนิติบุคคล
    </p>
    <p class="b2 mb-3">
      <b> เคล็ดลับ:</b> คุณสามารถใช้เครื่องหมาย " "
      ครอบคำที่ต้องการค้นหาเพื่อให้การสืบค้นแม่นยำมากยิ่งขึ้น
    </p>
    <p class="b2 text-[#74060A]">
      โปรดทราบว่าผลลัพธ์จากการค้นหาและประมวลผลของ ACT Ai
      อาจมีข้อจำกัดจากความพร้อมของข้อมูล เพื่อความถูกต้อง
      <b>
        โปรดตรวจสอบข้อมูลกับระบบต้นทางของหน่วยงานภาครัฐอีกครั้งก่อนนำไปใช้อ้างอิง</b
      >
    </p>
  </div>
</template>

<script setup></script>

<style lang="scss" scoped></style>
