<template>
  <div>
    <p class="b1 font-bold mb-3">ACT Ai ตรวจสอบโครงการเสี่ยงอย่างไร ?</p>
    <p class="b1"><b>1. ตรวจสอบพฤติกรรมการเสนอราคา</b> ในประเด็น</p>
    <ul class="list-disc ml-5">
      <li v-for="item in data" class="b2">{{ item }}</li>
    </ul>

    <p class="b1">
      <b>2. จับตาความโปร่งใสในการจัดซื้อจัดจ้างของหน่วยงานรัฐ</b> ในประเด็น
    </p>
    <ul class="list-disc ml-5 b2">
      <li>ราคากลางสูง/ต่ำกว่างบประมาณ</li>
      <li>โครงการเฉพาะเจาะจงที่จัดซื้อจัดจ้างท้ายปีงบประมาณ</li>
      <li>โครงการเฉพาะเจาะจงที่ส่อหั่นสัญญาแบ่งช่วง หรือหลีกเลี่ยงการประมูล</li>
    </ul>

    <p class="b1"><b>3. เฝ้าระวังและป้องกันการทุจริต</b> ในประเด็น</p>

    <ul class="list-disc ml-5 b2">
      <li>คู่เทียบมีกรรมการหรือที่อยู่เดียวกัน</li>
      <li>คู่เทียบเคยมีประวัติการเสนอราคาด้วยกันบ่อยครั้ง</li>
      <li>ผู้เข้าเสนอราคามีประวัติทิ้งงาน</li>
    </ul>

    <p class="b2 mt-3">
      <img
        src="../../public/src/images/risk-flag.svg"
        alt="risk"
        class="inline w-5 mb-2"
      />
      เป็นเพียงการระบุความเสี่ยงเท่านั้น
      ซึ่งไม่ได้หมายความว่ามีการทุจริตเกิดขึ้นแล้ว
    </p>
  </div>
</template>

<script setup>
const data = ref([
  'เสนอราคาใกล้ราคากลาง',
  'เสนอราคาสูง',
  'เสนอราคาสูงกว่าราคากลาง',
  'เสนอราคาเกาะกลุ่ม',
  'เสนอราคาเท่ากัน',
  'เสนอราคาต่ำกว่าราคากลางผิดปกติ',
  'เสนอราคาต่ำกว่าผู้เสนอรายอื่นผิดปกติ',
  'มูลค่าสัญญาสูงกว่าราคาประมูลชนะ',
  'มีผู้เสนอราคาน้อยกว่า 3 ราย (ไม่เป็นไปตามที่กฎหมายกำหนด)',
  'คู่เทียบมีกรรมการหรือที่อยู่เดียวกัน',
  'คู่เทียบเคยมีประวัติการเสนอราคาด้วยกันบ่อยครั้ง',
  'ผู้เข้าเสนอราคามีประวัติทิ้งงาน',
]);
</script>

<style lang="scss" scoped></style>
