<template>
  <div class="b2">
    <p class="b1 font-bold mb-3">วิธีการจัดหา มีอะไรบ้าง ลักษณะเป็นอย่างไร?</p>
    <p>การจัดซื้อจ้ดจ้าง มีรูปแบบวิธีการ 3 ประเภททั่วไปตาม พรบ. 2560 ดังนี้</p>
    <p><b>1. ประกาศเชิญชวนทั่วไป</b> คือ</p>
    <p>
      การที่หน่วยงานของรัฐเชิญชวนผู้ประกอบการทั่วไปที่มีคุณสมบัติตรงตามเงื่อนไขที่หน่วยงานของรัฐกําหนดให้เข้ายื่นข้อเสนอ
      มี 3 วิธีการดังนี้
    </p>

    <ul class="list-disc ml-5 b2">
      <li>
        <b> วิธีตลาดอิเล็กทรอนิกส์ (e-market)</b> คือ
        การจัดหาพัสดุที่เป็นสินค้าหรือบริการทั่วไป มีคุณลักษณะไม่ซับซ้อน
        มีการกำหนดในมาตรฐานราชการจัดซื้อสินค้า หรืองานจ้างในระบบ e-catalog
        เช่น กระดาษที่ใช้ถ่ายเอกสารหรือพิมพ์ทั่วไป ตลับหมึก แฟ้มใส่เอกสาร
        ซองเอกสาร
      </li>
      <li>
        <b>ประกวดราคาอิเล็กทรอนิกส์ (e-bidding)</b> คือ
        การจัดหาพัสดุที่มีความเฉพาะ มีความซับซ้อน มีเทคนิคเฉพาะ หรือที่ไม่มีใน
        e-market ที่มีวงเงินตั้งแต่ 500,000 ขึ้นไป แต่ไม่เกิน 5,000,000 บาท
      </li>
      <li>
        <b>สอบราคา</b> คือ
        การจัดซื้อจัดจ้างในกรณีที่หน่วยงานของรัฐไม่สามารถดำเนินการผ่านระบบตลาดอิเล็กทรอนิกส์
        หรือประกวดราคา e-bidding ที่มีวงเงินตั้งแต่ 500,000 ขึ้นไป แต่ไม่เกิน
        5,000,000 บาท
      </li>
    </ul>

    <p><b>2. วิธีคัดเลือก</b> คือ</p>
    <p>
      คือ หน่วยงานของรัฐเชิญชวนเฉพาะผู้ประกอบการที่มีคุณสมบัติตามกำหนดอย่างน้อย
      3 ราย ให้ยื่นข้อเสนอ (เว้นแต่มีผู้ตรงคุณสมบัติน้อยกว่า 3 ราย)
    </p>

    <p><b>3. วิธีเฉพาะเจาะจง</b> คือ</p>
    <p>
      คือ
      หน่วยงานของรัฐเชิญชวนให้ผู้ประกอบการรายใดรายหนึ่งที่มีคุณสมบัติตามกำหนด
      เข้ายื่นข้อเสนอหรือเจรจาต่อรองราคา
    </p>

    <div class="my-2">
      <a href="/learn" target="_blank" class="text-[#0B5C90] b2"
        >ดูคำอธิบายอย่างละเอียด</a
      >
    </div>

    <p>
      หมายเหตุ: วิธีการจัดซื้อจัดจ้างที่ปรากฏบนชาร์ทอาจมีมากกว่าที่อธิบายข้างต้น
      ซึ่งเกิดจากการใช้ระเบียบเก่าขอบางโครงการ
    </p>
  </div>
</template>

<script setup>
const data = ref([
  'เสนอราคาใกล้ราคากลาง',
  'เสนอราคาสูง',
  'เสนอราคาสูงกว่าราคากลาง',
  'เสนอราคาเกาะกลุ่ม',
  'เสนอราคาเท่ากัน',
  'เสนอราคาต่ำกว่าราคากลางผิดปกติ',
  'เสนอราคาต่ำกว่าผู้เสนอรายอื่นผิดปกติ',
  'มูลค่าสัญญาสูงกว่าราคาประมูลชนะ',
  'มีผู้เสนอราคาน้อยกว่า 3 ราย (ไม่เป็นไปตามที่กฎหมายกำหนด)',
  'คู่เทียบมีกรรมการหรือที่อยู่เดียวกัน',
  'คู่เทียบเคยมีประวัติการเสนอราคาด้วยกันบ่อยครั้ง',
  'ผู้เข้าเสนอราคามีประวัติทิ้งงาน',
]);
</script>

<style lang="scss" scoped></style>
