<template>
  <div>
    <p class="b1 font-bold mb-3">กราฟนี้บ่งบอกอะไร</p>
    <p class="b2 mb-3">
      กราฟแสดงวงเงินสัญญารวม และ งบประมาณรวม ในแต่ละปีงบประมาณ
      พร้อมคำนวณส่วนต่างระหว่างงบประมาณกับวงเงินสัญญา
      เพื่อให้ท่านใช้เป็นข้อมูลในการตั้งข้อสังเกตเกี่ยวกับการจัดสรรและใช้จ่ายงบประมาณของหน่วยงานรัฐ
    </p>
    <p class="b2 font-bold">ความหมายของแต่ละตัวเลข</p>

    <ul class="list-disc ml-5 b2">
      <li>
        <b> งบประมาณรวม</b> หมายถึง
        งบประมาณที่หน่วยงานรัฐได้รับจัดสรรงบประมาณสำหรับการจัดซื้อจัดจ้างภาครัฐในปีงบประมาณนั้น
        ๆ
      </li>
      <li>
        <b> วงเงินสัญญารวม</b> หมายถึง
        วงเงินที่หน่วยงานรัฐตกลงทำสัญญาร่วมกับคู่สัญญา (ผู้รับจ้าง)
        ในการจัดซื้อจัดจ้างในปีงบประมาณนั้น ๆ
      </li>
      <li>
        <b> ส่วนต่าง</b> หมายถึง
        ส่วนต่างระหว่างงบประมาณกับวงเงินสัญญาในปีงบประมาณนั้น ๆ
      </li>
    </ul>
  </div>
</template>

<script setup></script>

<style lang="scss" scoped></style>
