<template>
  <Header />
  <div class="p-5 !pb-10 bg-[#F5F5F5]">
    <Breadcrumb title="นโยบายข้อมูลส่วนบุคคลสำหรับการใช้คุกกี้" />
    <h3 class="font-bold max-w-6xl mx-auto">
      นโยบายข้อมูลส่วนบุคคลสำหรับการใช้คุกกี้
    </h3>
  </div>

  <div class="max-w-6xl mx-auto p-5 sm:p-10 b1">
    <p class="mb-3">
      <b> องค์กรต่อต้านคอร์รัปชัน (ประเทศไทย)</b>
      มีความจำเป็นต้องใช้คุกกี้ในการทำงานหลายส่วนของเว็บไซต์เพื่อรับประกันการให้บริการของเว็บไซต์ที่จะอำนวยความสะดวกในการใช้บริการเว็บไซต์ของท่าน
      โดยองค์กรรับประกันว่าจะใช้คุกกี้เท่าที่จำเป็น
      และมีมาตรการรักษาความมั่นคงปลอดภัยของข้อมูลของท่านโดยสอดคล้องกับกฎหมายที่เกี่ยวข้อง
      และจะไม่เปิดเผยข้อมูลดังกล่าวให้แก่บุคคลอื่น
      เว้นแต่เป็นกรณีการใช้คุกกี้บางประเภทที่อาจดำเนินการโดยผู้ให้บริการภายนอก
      ทั้งนี้เมื่อท่านเข้าใช้บริการเว็บไซต์องค์กรจะถือว่าท่านรับทราบและตกลงนโยบายข้อมูลส่วนบุคคลฉบับนี้แล้ว
      โดยองค์กรสงวนสิทธิ์ในการปรับปรุงนโยบายฉบับนี้ตามแต่ละระยะเวลาที่องค์กรเห็นสมควร
      โดยองค์กรจะแจ้งให้ท่านทราบถึงการเปลี่ยนแปลงดังกล่าวผ่านทางเว็บไซต์นี้ 
    </p>

    <p>
      <b>ประเภทและวัตถุประสงค์การใช้คุกกี้ขององค์กร</b>
      <br />
      องค์กรมีความจำเป็นต้องใช้คุกกี้หลายประเภทเพื่อจุดประสงค์ที่แตกต่างกันไป
      โดยแบ่งออกเป็น 2  ประเภท ดังต่อไปนี้ 
    </p>

    <ul class="list-decimal ml-5">
      <li>
        <b>Strictly Necessary Cookies</b>
        ซึ่งเป็นคุกกี้ประเภทที่มีความจำเป็นอย่างมากต่อการทำงานให้บริการของเว็บไซต์แก่ผู้ใช้บริการ 
      </li>
      <li>
        <b> Performance Cookies</b>
        ซึ่งเป็นคุกกี้ประเภทที่ประเมินประสิทธิภาพในการทำงานแต่ละส่วนของเว็บไซต์
        ทั้งนี้คุกกี้ประเภทดังกล่าวอาจดำเนินการโดยผู้ให้บริการภายนอก 
      </li>
    </ul>

    <p class="mb-3">
      สำหรับคุกกี้ประเภทอื่นนอกเหนือจาก Strictly Necessary Cookies
      หากได้รับความยินยอมจากท่าน
      องค์กรจะใช้คุกกี้ดังกล่าวเพื่อวัตถุประสงค์เฉพาะที่ได้ระบุไว้ 
      ทั้งนี้องค์กรใช้โปรแกรม Plausible และ Clarity
      ในการเก็บข้อมูลการใช้บริการเว็บไซต์ของท่าน สิทธิของเจ้าของข้อมูล
      องค์กรรับทราบ และเคารพสิทธิของท่านในฐานะเจ้าของข้อมูลตามกฎหมาย
      โดยเฉพาะสิทธิถอนความยินยอมได้ทางหน้าเว็บไซต์
      และท่านสามารถลบการตั้งค่าคุกกี้บน Browser ของตนเองได้เช่นกัน
      หรือหากมีข้อสงสัยสามารถติดต่อได้ที่:
      <a href="mailto:act@anticorruption.in.th" class="text-[#0B5C90] underline"
        >act@anticorruption.in.th</a
      >
    </p>

    <p class="mb-3">
      <b>สิทธิของเจ้าของข้อมูล</b><br />
      องค์กรรับทราบ และเคารพสิทธิของท่านในฐานะเจ้าของข้อมูลตามกฎหมาย
      โดยเฉพาะสิทธิถอนความยินยอมได้ทางหน้าเว็บไซต์
      และท่านสามารถลบการตั้งค่าคุกกี้บน Browser ของตนเองได้เช่นกัน
      หรือหากมีข้อสงสัยสามารถติดต่อได้ที่:
      <a href="mailto:act@anticorruption.in.th" class="text-[#0B5C90] underline"
        >act@anticorruption.in.th</a
      >
    </p>
  </div>
  <Footer />
</template>
