<template>
  <Header />
  <div class="p-5 !pb-10 bg-[#F5F5F5]">
    <Breadcrumb title="เข้าใจการจัดซื้อจัดจ้าง" />
    <h3 class="font-bold max-w-6xl mx-auto">เข้าใจการจัดซื้อจัดจ้างภาครัฐ</h3>
  </div>
  <div class="max-w-6xl mx-auto p-5 sm:p-10 b1">
    <ClientOnly fallback-tag="span" fallback="Loading...">
      <Disclosure>
        <DisclosureButton class="disclosure-btn" id="การจัดซื้อจัดจ้างภาครัฐ">
          <ChevronDownIcon class="size-6" />
          <h5 class="font-bold">การจัดซื้อจัดจ้างภาครัฐ คืออะไร ?</h5>
        </DisclosureButton>
        <DisclosurePanel class="disclosure-panel">
          พระราชบัญญัติการจัดซื้อจัดจ้างและการบริหารพัสดุภาครัฐ พ.ศ. 2560
          ได้ให้คำนิยามไว้ว่า
          <ul class="list-disc ml-5">
            <li>
              การจัดซื้อจัดจ้าง หมายถึง
              การดำเนินการเพื่อให้ได้มาซึ่งพัสดุโดยการซื้อ จ้าง เช่า แลกเปลี่ยน
              หรือโดยนิติกรรมอื่นตามที่กำหนดในกฎกระทรวง
            </li>
            <li>
              พัสดุ หมายถึง สินค้า งานบริการ งาน ก่อสร้าง
              งานจ้างที่ปรึกษาและงานจ้างออกแบบ หรือควบคุมงานก่อสร้าง
              รวมทั้งการดำเนินการอื่นตามที่กำหนดในกฎกระทรวง
            </li>
          </ul>
        </DisclosurePanel>
      </Disclosure>

      <hr class="my-5" />

      <Disclosure>
        <DisclosureButton class="disclosure-btn" id="เกี่ยวข้องกับใครบ้าง">
          <ChevronDownIcon class="size-6" />
          <h5 class="font-bold">เกี่ยวข้องกับใครบ้าง ?</h5>
        </DisclosureButton>
        <DisclosurePanel class="disclosure-panel">
          <ul class="list-disc ml-5">
            <li>
              <b>หน่วยงานของรัฐ ได้แก่</b>
              ราชการส่วนกลาง ส่วนภูมิภาค ส่วนท้องถิ่น
              รัฐวิสาหกิจตามกฎหมายว่าด้วยวิธีการงบประมาณ องค์การมหาชน
              องค์กรอิสระ องค์กรตามรัฐธรรมนูญ หน่วยธุรการของศาล
              มหาวิทยาลัยในกํากับ หน่วยงานสังกัดรัฐสภาหรือในกํากับของรัฐสภา
              หน่วยงานอิสระของรัฐ และหน่วยงานอื่นตามที่กําหนดในกฎกระทรวง
            </li>
            <li>
              <b>ผู้ค้าภาครัฐ หรือ คู่สัญญากับหน่วยงานของรัฐ ได้แก่</b>
              บุคคลหรือนิติบุคคล (ผู้ประกอบการ)
              ที่ยื่นข้อเสนอหรือได้ลงนามในสัญญาหรือข้อตกลงเป็นคู่สัญญากับหน่วยงานของรัฐ
            </li>
            <li>
              <b>ประชาชน </b>เจ้าของภาษี 
              ผู้ได้รับประโยชน์จากสินค้าบริการและงานก่อสร้างที่มาจากการจัดซื้อจัดจ้างภาครัฐ
              รวมถึงผู้มีส่วนร่วมในการติดตามและตรวจสอบการดำเนินงานของรัฐให้เป็นไปอย่างโปร่งใส
              มีธรรมาภิบาล และมีประสิทธิภาพ
            </li>
          </ul>
        </DisclosurePanel>
      </Disclosure>

      <hr class="my-5" />

      <Disclosure>
        <DisclosureButton class="disclosure-btn" id="มีกระบวนการอะไรบ้าง">
          <ChevronDownIcon class="size-6" />
          <h5 class="font-bold">มีกระบวนการอะไรบ้าง</h5>
        </DisclosureButton>
        <DisclosurePanel class="disclosure-panel">
          <ul class="list-decimal ml-5">
            <li>หน่วยงานของรัฐได้รับจัดสรรงบประมาณประจำปี</li>
            <li>จัดทำแผนการจัดซื้อจัดจ้างประจำปีงบประมาณ</li>
            <li>จัดทำโครงการจัดซื้อจัดจ้าง</li>
            <li>
              เลือกวิธีการจัดซื้อจัดจ้างที่เหมาะสม (ขึ้นอยู่กับสินค้า/บริการ
              งบประมาณ ตามระเบียบของกรมบัญชีกลาง)
            </li>
            <li>
              เข้าสู่กระบวนการจัดซื้อจัดจ้างภาครัฐ
              โดยขั้นตอนและกระบวนการจัดซื้อจัดจ้างในส่วนนี้
              จะมีรายละเอียดที่ต่างกันไปขึ้นอยู่กับ “วิธีการจัดหา”
            </li>
          </ul>

          <div class="bg-[#F5F5F5] p-3 mt-3 rounded-md">
            <p class="font-bold">
              ตัวอย่างขั้นตอบของวิธีการจัดหา “ประกวดราคาอิเล็กทรอนิกส์
              (e-bidding)”
            </p>
            <ul>
              <li v-for="(item, i) in mockdata" :key="i">
                5.{{ i + 1 }} {{ item }}
              </li>
            </ul>
          </div>
        </DisclosurePanel>
      </Disclosure>

      <hr class="my-5" />

      <Disclosure>
        <DisclosureButton class="disclosure-btn">
          <ChevronDownIcon class="size-6" />
          <h5 class="font-bold">วิธีการจัดหา มีอะไรบ้าง ลักษณะเป็นอย่างไร?</h5>
        </DisclosureButton>
        <DisclosurePanel class="disclosure-panel">
          <p class="mb-3">การจัดซื้อจ้ดจ้าง มีรูปแบบวิธีการ 3 ประเภท ดังนี้</p>

          <div class="mb-3">
            <p class="font-bold">1. ประกาศเชิญชวนทั่วไป</p>
            <p>
              การที่หน่วยงานของรัฐเชิญชวนผู้ประกอบการทั่วไปที่มีคุณสมบัติตรงตามเงื่อนไขที่หน่วยงานของรัฐกําหนดให้เข้ายื่นข้อเสนอ
              มี 3 วิธีการดังนี้
            </p>
          </div>

          <div class="mb-3 px-3">
            <p class="font-bold">1.1 วิธีตลาดอิเล็กทรอนิกส์ (e-market)</p>
            <div class="my-2 rounded-full p-1 bg-[#DADADA] font-bold b3 w-fit">
              ความหมายอย่างง่าย
            </div>
            <p>
              การจัดหาพัสดุที่เป็นสินค้าหรือบริการทั่วไป มีคุณลักษณะไม่ซับซ้อน
              มีการกำหนดในมาตรฐานราชการจัดซื้อสินค้า หรืองานจ้างในระบบ e-catalog
              เช่น กระดาษที่ใช้ถ่ายเอกสารหรือพิมพ์ทั่วไป ตลับหมึก แฟ้มใส่เอกสาร
              ซองเอกสาร
            </p>
            <div class="my-2 rounded-full p-1 bg-[#DADADA] font-bold b3 w-fit">
              คำอธิบายอย่างละเอียด
            </div>
            <p>
              การจัดหาพัสดุที่มีคุณลักษณะที่ไม่ซับซ้อน
              เป็นสินค้าหรือบริการทั่วไปที่มีการกำหนดมาตรฐานราชการจัดซื้อสินค้าหรืองานจ้างในระบบ
              e - catalog ซึ่งสามารถใช้วิธีประกาศได้ 2 ลักษณะ ได้แก่
            </p>
            <ul class="list-decimal ml-5">
              <li>
                การเสนอราคาโดยใบเสนอราคา (Request for Quotation: RFQ)
                ใช้ในกรณีที่การจัดหาพัสดุครั้งหนึ่ง ซึ่งมีราคาเกิน 500,000 บาท
                แต่ไม่เกิน 5,000,000 บาท
              </li>
              <li>
                การเสนอราคาโดยการประมูลอิเล็กทรอนิกส์ (Thai Auction)
                ใช้ในกรณีที่การจัดหาพัสดุครั้งหนึ่ง ซึ่งมีราคาเกิน 5,000,000 บาท
              </li>
            </ul>
          </div>

          <div class="bg-[#F5F5F5] p-3 mb-3 rounded-md">
            <p class="b3 text-[#8E8E8E] font-bold">คำอธิบายเพิ่มเติม</p>
            <p>
              <b> e-catalog (Electronic Catalog)</b> คือระบบข้อมูลสินค้า
              หรือบริการทั่วไปที่ผู้ประกอบการที่มีประสงค์จะเข้าร่วมการเสนอราคาวิธีตลาดอิเล็กทรอนิกส์
              (e - market) จะต้องนำรายละเอียดของพัสดุ ภาพสินค้า หรือบริการ
              ลงทะเบียนไว้ในระบบจัดซื้อจัดจ้างภาครัฐด้วยอิเล็กทรอนิกส์
              (Electronic Government Procurement : e - GP) ของกรมบัญชีกลาง
            </p>
          </div>

          <div class="mb-3 px-3">
            <p class="font-bold">1.2 ประกวดราคาอิเล็กทรอนิกส์ (e-bidding)</p>
            <div class="my-2 rounded-full p-1 bg-[#DADADA] font-bold b3 w-fit">
              ความหมายอย่างง่าย
            </div>
            <p>
              การจัดหาพัสดุที่มีความเฉพาะ มีความซับซ้อน มีเทคนิคเฉพาะ
              หรือที่ไม่มีใน e-market ที่มีวงเงินตั้งแต่ 500,000 ขึ้นไป
              แต่ไม่เกิน 5,000,000 บาท
            </p>
            <div class="my-2 rounded-full p-1 bg-[#DADADA] font-bold b3 w-fit">
              คำอธิบายอย่างละเอียด
            </div>
            <p>
              การจัดหาพัสดุครั้งหนึ่งซึ่งมีราคาเกิน 500,000 บาท
              โดยเป็นการจัดหาพัสดุที่มีรายละเอียดคุณลักษณะที่มีความซับซ้อน
              มีเทคนิคเฉพาะ หรือเป็นสินค้าหรือบริการที่ไม่ได้กําหนดไว้ในระบบ
              e–market (สินค้าหรือบริการทั่วไป มีมาตรฐาน
              ซึ่งกําหนดให้ส่วนราชการจัดซื้อสินค้าหรืองานจ้าง)
            </p>
          </div>

          <div class="mb-3 px-3">
            <p class="font-bold">1.3 สอบราคา</p>
            <div class="my-2 rounded-full p-1 bg-[#DADADA] font-bold b3 w-fit">
              ความหมายอย่างง่าย
            </div>
            <p>
              การจัดซื้อจัดจ้างในกรณีที่หน่วยงานของรัฐไม่สามารถดำเนินการผ่านระบบตลาดอิเล็กทรอนิกส์
              หรือประกวดราคา e-bidding ที่มีวงเงินตั้งแต่ 500,000 ขึ้นไป
              แต่ไม่เกิน 5,000,000 บาท
            </p>
            <div class="my-2 rounded-full p-1 bg-[#DADADA] font-bold b3 w-fit">
              คำอธิบายอย่างละเอียด
            </div>
            <p>
              การซื้อหรือจ้างครั้งหนึ่งซึ่งมีวงเงินเกิน 500,000 บาท แต่ไม่เกิน
              5,000,000 บาท
              ให้กระทำได้ในกรณีที่หน่วยงานของรัฐนั้นตั้งอยู่ในพื้นที่ที่มีข้อจำกัดในการใช้สัญญาณอินเตอร์เน็ต
              ทำให้ไม่สามารถดำเนินการผ่านระบบตลาดอิเล็กทรอนิกส์
              หรือระบบประกวดราคาอิเล็กทรอนิกส์ได้ ทั้งนี้
              ให้เจ้าหน้าที่ระบุเหตุผลความจำเป็นที่ไม่อาจดำเนินการซื้อหรือจ้างด้วยวิธีตลาดอิเล็กทรอนิกส์
              หรือวิธีประกวดราคาอิเล็กทรอนิกส์ไว้ในรายงานขอซื้อหรือขอจ้าง
            </p>
          </div>

          <p class="font-bold mb-3">2. วิธีคัดเลือก</p>

          <div class="mb-3 px-3">
            <div class="my-2 rounded-full p-1 bg-[#DADADA] font-bold b3 w-fit">
              ความหมายอย่างง่าย
            </div>
            <p>
              หน่วยงานของรัฐเชิญชวนเฉพาะผู้ประกอบการที่มีคุณสมบัติตามกำหนดอย่างน้อย
              3 ราย ให้ยื่นข้อเสนอ (เว้นแต่มีผู้ตรงคุณสมบัติน้อยกว่า 3 ราย)
            </p>
            <div class="my-2 rounded-full p-1 bg-[#DADADA] font-bold b3 w-fit">
              คำอธิบายอย่างละเอียด
            </div>
            <p>
              การที่หน่วยงานของรัฐเชิญชวนเฉพาะผู้ประกอบการที่มีคุณสมบัติตรงตามเงื่อนไขที่หน่วยงานของรัฐกําหนดซึ่งต้องไม่น้อยกว่า
              3 ราย ให้เข้ายื่นข้อเสนอ
              เว้นแต่ในงานนั้นมีผู้ประกอบการที่มีคุณสมบัติตรงตามที่กําหนดน้อยกว่า
              3 ราย
            </p>
          </div>

          <p class="font-bold mb-3">3. วิธีเฉพาะเจาะจง</p>

          <div class="mb-3 px-3">
            <div class="my-2 rounded-full p-1 bg-[#DADADA] font-bold b3 w-fit">
              ความหมายอย่างง่าย
            </div>
            <p>
              หน่วยงานของรัฐเชิญชวนให้ผู้ประกอบการรายใดรายหนึ่งที่มีคุณสมบัติตามกำหนด
              เข้ายื่นข้อเสนอหรือเจรจาต่อรองราคา
            </p>
            <div class="my-2 rounded-full p-1 bg-[#DADADA] font-bold b3 w-fit">
              คำอธิบายอย่างละเอียด
            </div>
            <p>
              การที่หน่วยงานของรัฐเชิญชวนผู้ประกอบการที่มีคุณสมบัติตรงตามเงื่อนไขที่หน่วยงานของรัฐกําหนดรายใดรายหนึ่งให้เข้ายื่นข้อเสนอ
              หรือให้เข้ามาเจรจาต่อรองราคา
              รวมทั้งการจัดซื้อจัดจ้างพัสดุกับผู้ประกอบการโดยตรง
              ในวงเงินเล็กน้อยตามที่กําหนดในกฎกระทรวง (ไม่เกิน 500,000 บาท)
            </p>
          </div>
        </DisclosurePanel>
      </Disclosure>

      <hr class="my-5" />

      <Disclosure>
        <DisclosureButton class="disclosure-btn">
          <ChevronDownIcon class="size-6" />
          <h5 class="font-bold">การเลือกใช้วิธีการจัดหาจัดซื้อจัดจ้างพัสดุ</h5>
        </DisclosureButton>
        <DisclosurePanel class="disclosure-panel">
          <p class="mb-3 font-bold">
            1. ให้หน่วยงานของรัฐเลือกใช้วิธีประกาศเชิญชวนทั่วไปก่อน 
          </p>

          <p class="font-bold">2. กรณีที่ใช้วิธีการคัดเลือก</p>

          <ul class="mb-3">
            <li v-for="(item, i) in mockdata2" :key="i">
              2.{{ i + 1 }} {{ item }}
            </li>
          </ul>

          <p class="font-bold">3. กรณีที่ใช้วิธีเฉพาะเจาะจง</p>

          <ul class="mb-3">
            <li v-for="(item, i) in mockdata3" :key="i">
              2.{{ i + 1 }} {{ item }}
            </li>
          </ul>

          <p class="font-bold">ที่มา:</p>
          <ul class="list-disc ml-5">
            <li>
              ข้อมูลการจัดซื้อจัดจ้างภาครัฐฯ ของกองการพัสดุภาครัฐ กรมบัญชีกลาง
            </li>
            <li>
              พ.ร.บ.การจัดซื้อจัดจ้างฯ พระราชบัญญัติ
              การจัดซื้อจัดจ้างและการบริหารพัสดภาครัฐ พ.ศ. ๒๕๖๐
            </li>
          </ul>
        </DisclosurePanel>
      </Disclosure>

      <hr class="my-5" />

      <Disclosure>
        <DisclosureButton class="disclosure-btn">
          <ChevronDownIcon class="size-6" />
          <h5 class="font-bold">งบประมาณ ราคากลาง และวงเงินสัญญา คืออะไร ?</h5>
        </DisclosureButton>
        <DisclosurePanel class="disclosure-panel">
          <p class="font-bold">งบประมาณ</p>
          <p class="mb-3">
            หมายถึง
            งบประมาณที่หน่วยงานเจ้าของโครงการได้รับจัดสรรงบประมาณมาสำหรับการจัดซื้อจัดจ้างโครงการนี้
          </p>

          <p class="font-bold">ราคากลาง</p>
          <p>
            หมายถึง
            ราคาเพื่อใช้เป็นฐานสำหรับเปรียบเทียบราคาที่ผู้ยื่นข้อเสนอได้ยื่นเสนอไว้
            ซึ่งสามารถจัดซื้อจัดจ้างได้จริงตามลำดับ ดังต่อไปนี้
          </p>
          <ul class="list-decimal ml-5 mb-3">
            <li>
              ราคาที่ได้มาจากการคำนวณตามหลักเกณฑ์ที่คณะกรรมการราคากลางกำหนด
            </li>
            <li>
              ราคาที่ได้มาจากฐานข้อมูลราคาอ้างอิงของพัสดุที่กรมบัญชีกลางจัดทำ
            </li>
            <li>ราคามาตรฐานที่สำนักงบประมาณหรือหน่วยงานกลางอื่นกำหนด</li>
            <li>ราคาที่ได้มาจากการสืบราคาจากท้องตลาด</li>
            <li>
              ราคาที่เคยซื้อหรือจ้างครั้งหลังสุดภายในระยะเวลาสองปีงบประมาณ
            </li>
            <li>
              ราคาอื่นใดตามหลักเกณฑ์ วิธีการ
              หรือแนวทางปฏิบัติของหน่วยงานของรัฐนั้น ๆ
            </li>
          </ul>

          <p class="font-bold">วงเงินสัญญา</p>
          <p class="mb-3">
            หมายถึง วงเงินที่หน่วยงานเจ้าของโครงการตกลงทำสัญญาร่วมกับคู่สัญญา
            (ผู้รับจ้าง) ในการจัดซื้อจัดจ้างโครงการนี้ 
          </p>
        </DisclosurePanel>
      </Disclosure>

      <hr class="my-5" />

      <Disclosure>
        <DisclosureButton
          class="disclosure-btn"
          id="อยากร่วมจับโกงต้องสังเกตจากอะไร"
        >
          <ChevronDownIcon class="size-6" />
          <h5 class="font-bold">อยากร่วมจับโกง ต้องสังเกตจากอะไร?</h5>
        </DisclosureButton>
        <DisclosurePanel class="disclosure-panel">
          <p class="mb-3">
            ACT Ai ใช้ AI แบบ rule-based
            ในการวิเคราะห์และระบุความเสี่ยงทุจริตเบื้องต้น
            ท่านสามารถสังเกตสัญลักษณ์
            <img
              src="../public/src/images/risk-flag.svg"
              alt="risk"
              class="inline w-5 mb-2"
            />
            ในหน้าโครงการและหน้าผู้รับจ้างเพื่อดูความเสี่ยงที่ควรตั้งข้อสังเกต
          </p>

          <p class="font-bold">ACT Ai ตรวจสอบโครงการเสี่ยงอย่างไร ?</p>

          <ul class="list-decimal ml-7 mb-3">
            <li>
              ตรวจสอบพฤติกรรมการเสนอราคา ในประเด็น
              <ul class="list-disc ml-7 mb-3">
                <li v-for="(item, i) in mockdata4" :key="i">{{ item }}</li>
              </ul>
            </li>
            <li>
              จับตาความโปร่งใสในการจัดซื้อจัดจ้างของหน่วยงานรัฐ ในประเด็น
              <ul class="list-disc ml-7 mb-3">
                <li v-for="(item, i) in mockdata5" :key="i">{{ item }}</li>
              </ul>
            </li>
            <li>
              เฝ้าระวังและป้องกันการทุจริต ในประเด็น
              <ul class="list-disc ml-7 mb-3">
                <li v-for="(item, i) in mockdata6" :key="i">{{ item }}</li>
              </ul>
            </li>
          </ul>

          <p class="font-bold">ACT Ai ตรวจสอบผู้รับจ้างที่น่าสนใจอย่างไร ?</p>

          <ul class="list-decimal ml-7 mb-3">
            <li>
              ตรวจสอบความสัมพันธ์กับนักการเมืองหรือข้าราชการระดับสูงที่ยื่นบัญชีทรัพย์สิน
              ในประเด็น

              <ul class="list-disc ml-7 mb-3">
                <li>
                  ที่ตั้งนิติบุคคลตรงกับที่อยู่ของนักการเมืองหรือข้าราชการที่ยื่นบัญชีทรัพย์สิน
                </li>
                <li>
                  กรรมการนิติบุคคลเป็นหรือเคยเป็นนักการเมืองหรือข้าราชการที่ยื่นบัญชีทรัพย์สิน
                </li>
                <li>
                  กรรมการนิติบุคคลเป็นเครือญาติกับนักการเมืองหรือข้าราชการที่ยื่นบัญชีทรัพย์สิน
                </li>
              </ul>
            </li>
            <li>ตรวจสอบประวัติการบริจาคเงินให้พรรคการเมือง</li>
            <li>ตรวจสอบประวัติการถูกขึ้นบัญชีผู้ทิ้งงาน</li>
          </ul>

          <p class="mb-3">
            นอกจากนี้ ACT Ai ยังประมวลและแสดงผลในรูปแบบที่เข้าใจง่าย
            ช่วยให้ท่านตั้งข้อสังเกตจากการคำนวณส่วนต่างราคา
            และการแสดงผลข้อมูลด้วยกราฟ เพื่อร่วมจับโกง ติดตาม ตรวจสอบ เฝ้าระวัง
            และป้องกันการทุจริตที่อาจเกิดขึ้น
          </p>

          <div class="bg-[#F5F5F5] p-3 mt-3 rounded-md">
            <p>
              หมายเหตุ: เป็นเพียงการระบุความเสี่ยงเท่านั้น
              ซึ่งไม่ได้หมายความว่ามีการทุจริตเกิดขึ้นแล้ว
            </p>
          </div>
        </DisclosurePanel>
      </Disclosure>

      <hr class="my-5" />
    </ClientOnly>
  </div>
  <Footer />
</template>

<script setup>
import { Disclosure, DisclosureButton, DisclosurePanel } from '@headlessui/vue';
import { ChevronDownIcon } from '@heroicons/vue/24/solid';

const mockdata = ref([
  'ประกาศเชิญชวนผู้ค้า (ผู้ประกอบการ) ให้ยื่นเสนอราคา',
  'ผู้ค้าซื้อซองประมูลงาน',
  'ยื่นเสนอราคาภายในระยะเวลาที่กำหนด',
  'หน่วยงานเจ้าของโครงการพิจารณาผล',
  'ประกาศผู้ชนะ',
  'จัดทำสัญญา',
  'เผยแพร่ข้อมูลสาระสำคัญในสัญญา',
  'เข้าสู่กระบวนการบริหารสัญญาต่อไป',
]);

const mockdata2 = ref([
  'ใช้วิธีประกาศเชิญชวนทั่วไปแล้ว แต่ไม่มีผู้ยื่นข้อเสนอ หรือข้อเสนอนั้นไม่ได้รับการคัดเลือก',
  'พัสดุที่ต้องการจัดซื้อจัดจ้างมีคุณลักษณะเฉพาะเป็นพิเศษ หรือซับซ้อนหรือต้องผลิตจําหน่าย ก่อสร้าง หรือให้บริการโดยผู้ประกอบการที่มีฝีมือโดยเฉพาะ หรือมีความชํานาญเป็นพิเศษหรือมีทักษะสูง และผู้ประกอบการนั้นมีจํานวนจํากัด',
  'มีความจําเป็นเร่งด่วนที่ต้องใช้พัสดุนั้น เนื่องจากเกิดเหตุการณ์ที่ไม่อาจคาดหมายได้ การใช้วิธีประกาศเชิญชวนทั่วไปจะทําให้ไม่ทันต่อความต้องการใช้พัสดุ',
  'เป็นพัสดุที่มีความเฉพาะตามลักษณะของการใช้งาน หรือมีข้อจํากัดทางเทคนิคที่จําเป็นต้องระบุยี่ห้อเป็นการเฉพาะ',
  'เป็นพัสดุที่จําเป็นต้องซื้อโดยตรงจากต่างประเทศ หรือดําเนินการโดยผ่านองค์การระหว่างประเทศ',
  'เป็นพัสดุที่ใช้ในราชการลับ หรือเป็นงานที่ต้องปกปิดเป็นความลับของหน่วยงานของรัฐหรือที่เกี่ยวกับความมั่นคงของประเทศ',
  'เป็นงานจ้างซ่อมพัสดุที่จําเป็นต้องถอดตรวจ ให้ทราบความชํารุดเสียหายเสียก่อน จึงจะประมาณค่าซ่อมได้ เช่น งานจ้างซ่อมเครื่องจักร เครื่องมือกล เครื่องยนต์ เครื่องไฟฟ้าหรือเครื่องอิเล็กทรอนิกส์',
]);

const mockdata3 = ref([
  'กรณีที่ใช้วิธีเฉพาะเจาะจง',
  'ใช้ทั้งวิธีประกาศเชิญชวนทั่วไปและวิธีคัดเลือก หรือใช้วิธีคัดเลือกแล้วแต่ไม่มีผู้ยื่นข้อเสนอ หรือข้อเสนอนั้นไม่ได้รับการคัดเลือก',
  'การจัดซื้อจัดจ้างพัสดุที่มีการผลิต จําหน่าย ก่อสร้าง หรือให้บริการทั่วไป และมีวงเงินในการจัดซื้อจัดจ้างครั้งหนึ่งไม่เกินวงเงินตามที่กําหนดในกฎกระทรวง (ไม่เกิน 500,000 บาท)',
  'การจัดซื้อจัดจ้างพัสดุที่มีผู้ประกอบการซึ่งมีคุณสมบัติโดยตรงเพียงรายเดียวหรือการจัดซื้อจัดจ้างพัสดุจากผู้ประกอบการซึ่งเป็นตัวแทนจําหน่ายหรือตัวแทนผู้ให้บริการโดยชอบด้วยกฎหมาย เพียงรายเดียวในประเทศไทยและไม่มีพัสดุอื่นที่จะใช้ทดแทนได้',
  'มีความจําเป็นต้องใช้พัสดุนั้นโดยฉุกเฉิน เนื่องจากเกิดอุบัติภัยหรือภัยธรรมชาติ หรือเกิดโรคติดต่ออันตรายตามกฎหมายว่าด้วยโรคติดต่อ และการจัดซื้อจัดจ้างโดยวิธีประกาศเชิญชวนทั่วไปหรือวิธีคัดเลือกอาจก่อให้เกิดความล่าช้าและอาจทําให้เกิดความเสียหายอย่างร้ายแรง',
  'พัสดุที่จะทําการจัดซื้อจัดจ้างเป็นพัสดุที่เกี่ยวพันกับพัสดุที่ได้ทําการจัดซื้อจัดจ้างไว้ก่อนแล้ว และมีความจําเป็นต้องทําการจัดซื้อจัดจ้างเพิ่มเติม เพื่อความสมบูรณ์หรือต่อเนื่องในการใช้พัสดุนั้น โดยมูลค่าของพัสดุที่ทําการจัดซื้อจัดจ้างเพิ่มเติมจะต้องไม่สูงกว่าพัสดุที่ได้ทําการจัดซื้อจัดจ้างไว้ก่อนแล้ว',
  'เป็นพัสดุที่จะขายทอดตลาดโดยหน่วยงานของรัฐ องค์การระหว่างประเทศหรือหน่วยงานของต่างประเทศ',
  'เป็นพัสดุที่เป็นที่ดินหรือสิ่งปลูกสร้างซึ่งจําเป็นต้องซื้อเฉพาะแห่ง',
  'กรณีอื่นตามที่กําหนดในกฎกระทรวง',
]);

const mockdata4 = ref([
  'เสนอราคาใกล้ราคากลาง',
  'เสนอราคาสูง',
  'เสนอราคาสูงกว่าราคากลาง',
  'เสนอราคาเกาะกลุ่ม',
  'เสนอราคาเท่ากัน',
  'เสนอราคาต่ำกว่าราคากลางผิดปกติ',
  'เสนอราคาต่ำกว่าผู้เสนอรายอื่นผิดปกติ',
  'มูลค่าสัญญาสูงกว่าราคาประมูลชนะ',
  'มีผู้เสนอราคาน้อยกว่า 3 ราย (ไม่เป็นไปตามที่กฎหมายกำหนด)',
  'คู่เทียบมีกรรมการหรือที่อยู่เดียวกัน',
  'คู่เทียบเคยมีประวัติการเสนอราคาด้วยกันบ่อยครั้ง',
  'ผู้เข้าเสนอราคามีประวัติทิ้งงาน',
]);

const mockdata5 = ref([
  'ราคากลางสูง/ต่ำกว่างบประมาณ',
  'โครงการเฉพาะเจาะจงที่จัดซื้อจัดจ้างท้ายปีงบประมาณ',
  'โครงการเฉพาะเจาะจงที่ส่อหั่นสัญญาแบ่งช่วง หรือหลีกเลี่ยงการประมูล',
]);

const mockdata6 = ref([
  'คู่เทียบมีกรรมการหรือที่อยู่เดียวกัน',
  'คู่เทียบเคยมีประวัติการเสนอราคาด้วยกันบ่อยครั้ง',
  'ผู้เข้าเสนอราคามีประวัติทิ้งงาน',
]);
</script>
