<template>
  <Header />
  <div class="p-5 sm:p-10 bg-[#F5F5F5]">
    <h3 class="font-bold max-w-6xl mx-auto">
      ข้อกำหนดและเงื่อนไขการอนุญาตให้ใช้ข้อมูลเพื่อการต่อต้านคอร์รัปชัน ของ
      องค์กรต่อต้านคอร์รัปชัน (ประเทศไทย)
    </h3>
  </div>
  <div class="max-w-6xl mx-auto p-5 sm:p-10 b1">
    <p class="mb-3">
      องค์กรต่อต้านคอร์รัปชัน (ประเทศไทย)
      ดำเนินการรวบรวมข้อมูลเปิดสาธารณะที่มีความสำคัญต่อการต่อต้านคอร์รัปชัน
      และทำการเชื่อมโยงข้อมูลดังกล่าวที่เผยแพร่ผ่านช่องทางต่าง ๆ
      ของหน่วยงานหรือองค์กร เพื่อประโยชน์ของสาธารณะในการสร้างความโปร่งใสในสังคม
      โดยอำนวยความสะดวกให้หน่วยงานที่มีหน้าที่ในการต่อต้านทุจริตคอร์รัปชันสามารถวิเคราะห์ข้อมูลเพื่อติดตามตรวจสอบได้โดยง่าย
      และอำนวยความสะดวกให้ประชาชนสามารถมีส่วนร่วมในการเฝ้าระวังการทุจริตคอร์รัปชันที่จะเกิดขึ้นในภาครัฐและภาคเอกชน
      และเป็นเครื่องมือในการป้องกันและปราบปรามการทุจริตคอร์รัปชันของสาธารณะ
      โดยเผยแพร่ข้อมูลชุดต่าง ๆ ผ่านเว็บไซต์ actai.co
      ให้ผู้ใช้ข้อมูลสามารถค้นหาและเข้าถึงข้อมูลได้โดยง่าย
      สามารถนำไปวิเคราะห์และพัฒนานวัตกรรมเพื่อแก้ไขปัญหาคอร์รัปชันของประเทศไทย
      ผู้ใช้ข้อมูลสามารถเข้าใช้ข้อมูลในเว็บไซต์นี้ได้
      ภายใต้การยอมรับข้อกำหนดและเงื่อนไขการอนุญาตให้ใช้ข้อมูลเพื่อการต่อต้านคอร์รัปชัน
      ดังนี้
    </p>
    <ClientOnly fallback-tag="span" fallback="Loading...">
      <Disclosure>
        <DisclosureButton class="disclosure-btn">
          <ChevronDownIcon class="size-6" />
          <h5 class="font-bold">คำนิยาม</h5>
        </DisclosureButton>
        <DisclosurePanel class="disclosure-panel">
          <p class="mb-3">
            <b>“ข้อกำหนด”</b> หมายความว่า
            ข้อกำหนดและเงื่อนไขการอนุญาตให้ใช้ข้อมูลเพื่อการต่อต้านคอร์รัปชัน
            ของ องค์กรต่อต้านคอร์รัปชัน (ประเทศไทย)
          </p>

          <p class="mb-3">
            <b>“ข้อมูล”</b> หมายความว่า
            สิ่งที่สื่อความหมายให้รู้เรื่องราวข้อเท็จจริงหรือเรื่องอื่นใด
            ไม่ว่าการสื่อความหมายนั้นจะทำได้โดยสภาพของสิ่งนั้นเองหรือโดยผ่านวิธีการใด
            ๆ และไม่ว่าจะได้จัดทำไว้ในรูปของเอกสาร แฟ้ม รายงาน หนังสือ แผนผัง
            แผนที่ ภาพวาด ภาพถ่าย ภาพถ่ายดาวเทียม ฟิล์ม การบันทึกภาพหรือเสียง
            การบันทึกโดยเครื่องคอมพิวเตอร์ เครื่องมือตรวจวัด การสำรวจระยะไกล
            หรือวิธีอื่นใดที่ทำให้สิ่งที่บันทึกไว้ปรากฏได้
          </p>

          <p class="mb-3">
            <b>“ข้อมูลเปิดเผย”</b> หมายความว่า ข้อมูลที่หน่วยงานหรือองค์กร
            เปิดเผยต่อสาธารณะตามกฎหมายว่าด้วยข้อมูลข่าวสารของราชการ
            หรือกฎหมายอื่นในรูปแบบข้อมูลดิจิทัลที่สามารถเข้าถึงและใช้ได้อย่างเสรี
            ไม่จำกัดแพลตฟอร์ม ไม่เสียค่าใช้จ่าย เผยแพร่ ทำซ้ำ
            หรือใช้ประโยชน์ได้โดยไม่จำกัดวัตถุประสงค์
          </p>

          <p class="mb-3">
            <b>“ผู้ใช้บริการ หรือ ผู้ใช้ข้อมูล”</b> หมายความว่า บุคคล คณะบุคคล
            นิติบุคคล หน่วยงาน
            หรือองค์กรทั้งภาครัฐและภาคเอกชนทั้งในประเทศและต่างประเทศ
            ที่เข้าใช้บริการเว็บไซต์ และใช้ข้อมูลซึ่งเผยแพร่บนเว็บไซต์ actai.co
            และตกลงยอมรับเงื่อนไขการใช้ข้อมูลภายใต้ข้อกำหนด
          </p>

          <p class="mb-3">
            <b>“การใช้ข้อมูล”</b> หมายความว่า
            การนำข้อมูลไม่ว่าทั้งหมดหรือบางส่วนไปใช้ประโยชน์ไม่ว่าจะด้วยรูปแบบหรือวิธีการใด
            ๆ หรือเพื่อวัตถุประสงค์ใด ๆ อันชอบด้วยกฎหมายของผู้ใช้ข้อมูล
            และภายใต้การยอมรับการปฏิบัติตามข้อกำหนดการได้มาซึ่งข้อมูล
          </p>
        </DisclosurePanel>
      </Disclosure>

      <hr class="my-5" />

      <Disclosure>
        <DisclosureButton class="disclosure-btn">
          <ChevronDownIcon class="size-6" />
          <h5 class="font-bold">ข้อตกลงการใช้งาน</h5>
        </DisclosureButton>
        <DisclosurePanel class="disclosure-panel">
          <ul class="list-decimal ml-5">
            <li>
              <b>การยอมรับข้อตกลง</b>
              ในการเข้าใช้บริการเว็บไซต์ actai.co
              ผู้ใช้บริการจะต้องอ่านและทำความเข้าใจข้อตกลงนี้อย่างละเอียด
              เพื่อให้ทราบสิทธิและข้อผูกพันระหว่างผู้ใช้บริการกับ
              องค์กรต่อต้านคอร์รัปชัน (ประเทศไทย) ทั้งนี้
              หากผู้ใช้บริการได้เริ่มใช้บริการเว็บไซต์ ทางองค์กรฯ
              จะถือว่าผู้ใช้บริการตกลงและยอมรับข้อตกลงฉบับนี้แล้ว
              หากผู้ใช้บริการปฏิเสธหรือไม่ยอมรับข้อตกลงฉบับนี้ องค์กรฯ
              ขอสงวนสิทธิ์ในการปฏิเสธการให้บริการต่าง ๆ แก่ผู้ใช้บริการ
              และขอให้ผู้ใช้บริการหยุดใช้เว็บไซต์โดยทันที
            </li>
            <li>
              <b>การแก้ไขเปลี่ยนแปลงข้อตกลง</b>
              องค์กรต่อต้านคอร์รัปชัน (ประเทศไทย)
              ขอสงวนสิทธิ์ในการแก้ไขเปลี่ยนแปลงรูปแบบการให้บริการ
              และทำการปรับปรุงแก้ไขเพิ่มเติมข้อตกลงฉบับนี้ตามที่องค์กรฯ
              เห็นว่าเหมาะสมด้วยดุลพินิจฝ่ายเดียวอันเป็นที่สุด โดยองค์กรฯ
              จะแจ้งการเปลี่ยนแปลงหรือแก้ไขเพิ่มเติมดังกล่าวให้ผู้ใช้บริการทราบผ่านช่องทางการติดต่อระหว่างองค์กรฯ
              และผู้ใช้บริการ และในกรณีที่ผู้ใช้บริการยังคงใช้บริการขององค์กรฯ
              ต่อภายหลังจากที่ผู้ใช้บริการได้รับการแจ้งการปรับปรุงข้อตกลงฉบับนี้แล้ว
              องค์กรฯ
              จะถือว่าผู้ใช้บริการยินยอมที่จะผูกพันกับข้อตกลงฉบับที่มีการปรับปรุงใหม่
            </li>
            <li>
              <b>ขอบเขตบังคับใช้ของข้อตกลง</b>
              ข้อตกลงฉบับนี้ใช้เฉพาะกับการให้บริการและการทำงานของเว็บไซต์ โดย
              องค์กรต่อต้านคอร์รัปชัน (ประเทศไทย)
              ตามที่ระบุไว้ภายใต้ข้อตกลงฉบับนี้เท่านั้น
              โดยจะไม่มีผลบังคับใช้กับการให้บริการ
              หรือการเชื่อมโยงเพื่อให้บริการอื่นของบุคคลภายนอกที่อาจต่อเนื่องมาจากเว็บไซต์
              ซึ่งองค์กรฯ ไม่มีอำนาจควบคุม องค์กรฯ
              จึงไม่รับประกันการให้บริการหรือประสิทธิภาพของบุคคลภายนอกดังกล่าว
              โดยองค์กรฯ
              แนะนำให้ผู้ใช้บริการศึกษาข้อตกลงการใช้บริการของบุคคลดังกล่าวโดยตรง
            </li>
          </ul>
        </DisclosurePanel>
      </Disclosure>

      <hr class="my-5" />

      <Disclosure>
        <DisclosureButton class="disclosure-btn">
          <ChevronDownIcon class="size-6" />
          <h5 class="font-bold">ขอบเขตการให้บริการ</h5>
        </DisclosureButton>
        <DisclosurePanel class="disclosure-panel">
          <p class="mb-3">
            เว็บไซต์ actai.co
            เปิดใช้งานให้แก่ผู้ที่สนใจเพื่อประโยชน์ของสาธารณะในการติดตามและตรวจสอบการดำเนินงานของหน่วยงานหรือองค์กร
            ให้มีความโปร่งใส
            และเป็นเครื่องมือในการป้องกันและปราบปรามการทุจริตคอร์รัปชัน
            ไม่มีการเรียกเก็บค่าใช้จ่ายในการใช้ข้อมูล
            ไม่ได้พัฒนาขึ้นเพื่อประโยชน์เชิงพาณิชย์
            หรือเพื่อวัตถุประสงค์ชี้นำทางการเมือง โดยดำเนินการภายใต้กลไก ดังนี้
          </p>

          <ul class="list-decimal ml-5 mb-3">
            <li>
              <b> การรวบรวมข้อมูลจากแหล่งข้อมูล</b> องค์กรต่อต้านคอร์รัปชัน
              (ประเทศไทย)
              จัดเก็บข้อมูลจากแหล่งข้อมูลเปิดของภาครัฐที่เผยแพร่ผ่านช่องทางต่าง
              ๆ ของหน่วยงานหรือองค์กร ปรับปรุงให้อยู่ในรูปแบบพร้อมใช้งาน
              (Machine-readable Format)
              และดำเนินการปรับปรุงอย่างสม่ำเสมอเพื่อให้ข้อมูลเป็นปัจจุบันมากที่สุด
              โดยผู้ใช้งานสามารถตรวจสอบความถูกต้องของข้อมูล ได้ดังนี้

              <ul class="list-disc ml-7 mb-3">
                <li v-for="(item, i) in mockdata">
                  <b>{{ item.name }}</b>
                  <ul class="list-disc ml-7">
                    <li v-for="(item2, j) in item.list">
                      {{ item2.name }}
                      <span v-if="item2.link != ''">
                        (<a
                          class="text-[#0B5C90] cursor-pointer"
                          :href="item.link"
                          target="_blank"
                          rel="noopener noreferrer"
                        >
                          {{ item2.link }}</a
                        >)</span
                      >
                    </li>
                  </ul>
                </li>
              </ul>
            </li>
            <li>
              <b> การนำเสนอข้อมูลเพื่อประโยชน์สาธารณะ</b>
              โดยอ้างอิงจากข้อมูลที่รวบรวมได้จากแหล่งที่มาที่น่าเชื่อถือ องค์กรฯ
              จะดำเนินการนำเสนอข้อมูลดังกล่าวใน 2 ลักษณะ ได้แก่ (ก)
              นำเสนอช่องทางการหาข้อมูล (เช่น การ redirect
              ไปที่หน้าเว็บไซต์ของแหล่งข้อมูลดังกล่าวโดยตรง)
              ให้ผู้ใช้งานใช้ในการค้นหาข้อมูลเพิ่มเติมตามความสนใจ และ (ข)
              นำเสนอข้อมูลที่น่าสนใจที่ได้รับโดยตรงจากแหล่งที่มาที่ระบุไว้มาปรับแต่งเพื่อนำเสนอในรูปแบบที่ง่ายต่อการทำความเข้าใจมากขึ้น
              ทั้งนี้อาจได้รับการนำเสนอในรูปแบบการนำเสนอข้อมูลดิบ (Informative
              content) หรือรูปแบบการนำข้อมูลเดิมมาวิเคราะห์เพิ่มเติม (Analytical
              content)
              โดยอ้างอิงจากตัวเลขสถิติและอาจรวมถึงข้อมูลตัวเลือกที่ผู้ใช้บริการเลือกผ่าน
              กลไกของระบบที่องค์กรฯ จัดทำขึ้น <br /><br />
              ทั้งนี้เพื่อหลีกเลี่ยงข้อสงสัย ในการนำเสนอข้อมูลไม่ว่ารูปแบบใด
              องค์กรฯ มีจุดประสงค์หลักในการนำเสนอข้อมูลเบื้องต้นเท่านั้น
              ไม่ได้มีจุดประสงค์ในการให้ข้อมูลสุดท้ายที่รับประกันความสอดคล้องของข้อมูลดังกล่าวกับความเป็นจริง
              โดยแม้องค์กรฯ
              จะใช้ความพยายามอย่างดีที่สุดในการรวบรวมข้อมูลจากแหล่งข้อมูลที่น่าเชื่อถือ
              แต่องค์กรฯ
              อาจไม่อยู่ในวิสัยที่จะสามารถตรวจสอบความถูกต้องของข้อมูลที่นำเสนอผ่านแหล่งข้อมูลที่นำมารวบรวมทั้งหมดได้
              อย่างไรก็ตามทางองค์กรฯ
              ได้แจ้งแหล่งที่มาของข้อมูลทั้งหมดไว้อย่างชัดเจน
              หากผู้ใช้งานเว็บไซต์มีข้อสงสัยหรือต้องการติดต่อเกี่ยวข้องกับเนื้อหาที่ได้รับการรวบรวม
              องค์กรฯ แนะนำให้ติดต่อโดยตรงไปยังแหล่งข้อมูลดังกล่าวโดยตรง
              และทางองค์กรฯ
              ไม่ได้ให้การรับประกันหรือรับผิดเกี่ยวกับเนื้อหาของข้อมูลทั้งหมดว่า
              จะเป็นจริงและถูกต้องในทุกแง่มุมและทุกสถานการณ
            </li>
          </ul>
        </DisclosurePanel>
      </Disclosure>

      <hr class="my-5" />

      <Disclosure>
        <DisclosureButton class="disclosure-btn">
          <ChevronDownIcon class="size-6" />
          <h5 class="font-bold">ข้อกำหนดและเงื่อนไขการใช้ข้อมูล</h5>
        </DisclosureButton>
        <DisclosurePanel class="disclosure-panel">
          <p class="mb-3">
            ผู้ใช้ข้อมูล มีสิทธิและหน้าที่ในการใช้ข้อมูลบนเว็บไซต์ actai.co
            ดังนี้
          </p>

          <ul class="list-decimal ml-7">
            <li>
              ทำซ้ำ เผยแพร่ แจกจ่าย หรือใช้ประโยชน์ในรูปแบบอื่นใด
              เพื่อวัตถุประสงค์ในการพัฒนาบริการและนวัตกรรมต่าง ๆ
              หรือเพื่อประโยชน์อื่นใดในการพัฒนาเศรษฐกิจและสังคม
              และพัฒนานวัตกรรมเพื่อแก้ไขปัญหาทุจริตคอร์รัปชันของประเทศไทย
            </li>
            <li>
              ประยุกต์ใช้ข้อมูล โดยวิธีการหรือรูปแบบต่าง ๆ
              ซึ่งไม่เป็นการปรับเปลี่ยนเนื้อหาสาระของข้อมูลให้สื่อความหมายผิดไปจากเดิม
            </li>
            <li>
              ใช้ประโยชน์จากข้อมูล โดยการเชื่อมโยงข้อมูลเข้ากับข้อมูลอื่น ๆ
              หรือการนำข้อมูลมาเป็นส่วนหนึ่งในการศึกษา วิเคราะห์ วิจัย
              พัฒนาบริการและนวัตกรรม
              หรือการดำเนินการอื่นใดเพื่อมุ่งให้เกิดประโยชน์แก่ส่วนรวมในการพัฒนาเศรษฐกิจและสังคม
              และพัฒนานวัตกรรมเพื่อแก้ไขปัญหาทุจริตคอร์รัปชันของประเทศไทย
            </li>
            <li>
              ปฏิบัติตามมาตรฐาน ข้อกำหนด
              และหลักเกณฑ์ที่เกี่ยวข้องกับการใช้ข้อมูลเพื่อการต่อต้านคอร์รัปชัน
              ของ องค์กรต่อต้านคอร์รัปชัน (ประเทศไทย)
            </li>
          </ul>
        </DisclosurePanel>
      </Disclosure>

      <hr class="my-5" />

      <Disclosure>
        <DisclosureButton class="disclosure-btn">
          <ChevronDownIcon class="size-6" />
          <h5 class="font-bold">การอ้างอิงข้อมูลจากเว็บไซต์ actai.co</h5>
        </DisclosureButton>
        <DisclosurePanel class="disclosure-panel">
          <p class="mb-3">
            ในการนำข้อมูลไม่ว่าทั้งหมดหรือบางส่วนไปใช้งาน
            หรือดำเนินการอื่นเพื่อวัตถุประสงค์ใด ๆ
            อันชอบด้วยกฎหมายของผู้ใช้ข้อมูล
            ผู้ใช้ข้อมูลต้องอ้างอิงถึงหน่วยงานของรัฐที่เป็นผู้จัดทำข้อมูล
            โดยใส่ข้อความเพื่อแสดงถึงแหล่งที่มาของข้อมูลเปิดภาครัฐ
            วันที่เข้าถึงข้อมูล และข้อมูลอื่น ๆ ที่จำเป็น <br />
            <br />
            องค์กรต่อต้านคอร์รัปชัน (ประเทศไทย)
            ขอสงวนสิทธิ์ในการเก็บค่าบริการการเข้าถึงข้อมูล
            การระงับชั่วคราวหรือยกเลิกการเผยแพร่ข้อมูลบนเว็บไซต์ actai.co
            หรือยกเลิกการให้ข้อมูลต่อไปไม่ว่ากรณีใด ๆ
            โดยไม่จำเป็นต้องบอกกล่าวล่วงหน้า และไม่ก่อให้เกิดความรับผิดชอบใด ๆ
            แก่องค์กรต่อต้านคอร์รัปชัน (ประเทศไทย)
          </p>
        </DisclosurePanel>
      </Disclosure>

      <hr class="my-5" />

      <Disclosure>
        <DisclosureButton class="disclosure-btn">
          <ChevronDownIcon class="size-6" />
          <h5 class="font-bold">ข้อกำหนดและเงื่อนไขการใช้บริการ</h5>
        </DisclosureButton>
        <DisclosurePanel class="disclosure-panel">
          <p class="mb-3">
            ผู้ใช้บริการตกลงใช้บริการทั้งหมดของเว็บไซต์
            ตามวัตถุประสงค์และตามวิธีการที่องค์กรต่อต้านคอร์รัปชัน (ประเทศไทย)
            กำหนดไว้ซึ่งเป็นการนำไปใช้เพื่อประโยชน์สาธารณะเท่านั้น
            หากผู้ใช้บริการต้องใช้ข้อมูลเพื่อวัตถุประสงค์อื่น
            โดยเฉพาะเพื่อพาณิชย์หรือการเมือง
            ผู้ใช้บริการต้องขอความยินยอมเป็นลายลักษณ์อักษรจากองค์กรต่อต้านคอร์รัปชัน
            (ประเทศไทย) ก่อนเท่านั้น
            <br /><br />
            หากมีกรณีที่ผู้ใช้บริการใช้เว็บไซต์เพื่อจุดประสงค์อื่นนอกเหนือจากที่องค์กรฯ
            กำหนดไว้ (ก) องค์กรฯ
            จะไม่รับผิดชอบต่อการกระทำของผู้ใช้บริการดังกล่าวไม่ว่าในลักษณะใด
            โดยถือเป็นการดำเนินการโดยผู้ใช้บริการฝ่ายเดียว (ข) องค์กรฯ
            มีสิทธิปฏิเสธการใช้งานของผู้ใช้บริการดังกล่าวได้ในทันที และ (ค)
            หากการกระทำผิดของผู้ใช้บริการดังกล่าวส่งผลกระทบสร้างความเสียหายต่อองค์กรฯ
            ไม่ว่าในลักษณะใด
            (รวมถึงแต่ไม่จำกัดเพียงการเรียกร้องให้รับผิดโดยบุคคลภายนอกที่อาจได้รับผลกระทบ)
            องค์กรฯ
            มีสิทธิอย่างสมบูรณ์ในการเรียกให้ผู้ใช้บริการที่ดำเนินการผิดเงื่อนไขดังกล่าวรับผิดชดเชยความเสียหายทั้งหมดที่อาจเกิดขึ้นกับองค์กรฯ
            ได้
          </p>
        </DisclosurePanel>
      </Disclosure>

      <hr class="my-5" />

      <Disclosure>
        <DisclosureButton class="disclosure-btn">
          <ChevronDownIcon class="size-6" />
          <h5 class="font-bold">ข้อห้ามในการใช้บริการ</h5>
        </DisclosureButton>
        <DisclosurePanel class="disclosure-panel">
          <p class="mb-3">
            นอกจากสิทธิและหน้าที่ในการใช้บริการและใช้ข้อมูลบนเว็บไซต์ actai.co
            ตามที่กำหนดไว้ใน “ข้อกำหนดและเงื่อนไขการใช้บริการ” และ
            “ข้อกำหนดและเงื่อนไขการใช้ข้อมูล” ผู้ใช้บริการต้องใช้บริการเว็บไซต์
            ภายใต้กรอบวัตถุประสงค์การให้บริการที่ องค์กรฯ
            แจ้งเป็นลายลักษณ์อักษรภายใต้ข้อตกลงฉบับนี้เท่านั้น
            โดยเฉพาะต้องไม่ดำเนินการใดที่ องค์กรต่อต้านคอร์รัปชัน (ประเทศไทย)
            กำหนดเป็นข้อห้าม ดังนี้
          </p>

          <ul class="list-decimal ml-7 mb-3">
            <li>
              ห้ามใช้บริการ
              เพื่อดำเนินการใดที่ผิดกฎหมายและขัดต่อความสงบเรียบร้อย
              หรือศีลธรรมอันดีของประชาชน หมิ่นประมาท หยาบคาย อนาจาร
              และ/หรือละเมิดสิทธิส่วนบุคคลของผู้อื่น
              รวมถึงไม่เผยแพร่ข้อมูลที่ไม่เป็นความจริงหรือทำให้เข้าใจผิด
            </li>
            <li>
              ห้ามดำเนินการที่เป็นการละเมิดสิทธิในทรัพย์สินทางปัญญาหรือสิทธิอื่นใดของผู้อื่น
              ซึ่งได้แก่ แต่ไม่จำกัดเพียงสิทธิของ องค์กรต่อต้านคอร์รัปชัน
              (ประเทศไทย)
            </li>
            <li>
              ห้ามใส่ไวรัสคอมพิวเตอร์ ชุดคำสั่ง หรือ Code คอมพิวเตอร์ใด ๆ ไฟล์
              หรือโปรแกรมอื่น ๆ ที่ออกแบบ
              ไว้เพื่อรบกวนหรือทำลายระบบหรือการทำงานของระบบ
              หรือเครื่องมืออุปกรณ์ เว็บไซต์ ซึ่งอาจนำไปสู่ความเสียหายต่อองค์กรฯ
              การให้บริการโดยรวมของเว็บไซต์ หรือการให้บริการแก่ผู้ใช้บริการอื่น
            </li>
            <li>
              ห้ามดำเนินการใดที่องค์กรฯ อาจพิจารณาด้วยดุลพินิจฝ่ายเดียวกำหนดว่า
              อาจก่อให้ผลกระทบความเสียหายต่อองค์กรฯ ไม่ว่าในลักษณะใด
            </li>
          </ul>

          <p class="mb-3">
            องค์กรฯ มีสิทธิแต่ไม่ใช่หน้าที่ในการตรวจสอบการเข้าถึง
            การใช้บริการในเวลาใด ๆ
            เพื่อให้แน่ใจว่าผู้ใช้บริการปฏิบัติตามข้อตกลงฉบับนี้
            โดยเฉพาะส่วนที่ระบุเป็นข้อห้าม
            ในกรณีที่ผู้ใช้บริการละเลยไม่ปฏิบัติตามข้อตกลงฉบับนี้ องค์กรฯ
            จะปฏิเสธการใช้งานเว็บไซต์ของผู้ใช้บริการดังกล่าวในทันที ทั้งนี้
            สิทธิที่กำหนดไว้ภายใต้ข้อตกลงฉบับนี้จะไม่กระทบกระเทือนกับสิทธิอื่นใดขององค์กรฯ
            ที่อาจมีภายใต้กฎหมายที่บังคับใช้หรือข้อผูกพันตามสัญญาอื่น
          </p>
        </DisclosurePanel>
      </Disclosure>

      <hr class="my-5" />

      <Disclosure>
        <DisclosureButton class="disclosure-btn">
          <ChevronDownIcon class="size-6" />
          <h5 class="font-bold">การชดเชยความเสียหายโดยผู้ใช้บริการ</h5>
        </DisclosureButton>
        <DisclosurePanel class="disclosure-panel">
          <p class="mb-3">
            ผู้ใช้บริการตกลงจะใช้บริการต่าง ๆ ของเว็บไซต์
            ตามขอบเขตของการให้บริการที่ได้มีการระบุไว้ข้างต้นรวมถึงข้อตกลงเฉพาะอื่น
            ๆ ที่องค์กรฯ
            อาจกำหนดไว้อันเกี่ยวเนื่องกับการให้บริการนอกเหนือจากข้อตกลงนี้
            โดยผู้ใช้บริการจะปฏิบัติตามคำแนะนำในการใช้บริการขององค์กรฯ
            อย่างเคร่งครัด และผู้ใช้บริการตกลงรับผิดชดใช้ให้แก่องค์กรฯ
            สำหรับความเสียหายใด ๆ ที่เกิดขึ้นกับองค์กรฯ
            ในกรณีที่ผู้ใช้บริการใช้บริการต่าง ๆ ขององค์กรฯ
            โดยไม่ปฏิบัติตามคำแนะนำขององค์กรฯ หรือใช้บริการผิดประเภท
            ผิดวัตถุประสงค์
            ไม่ว่าการกระทำดังกล่าวจะเป็นการกระทำโดยจงใจหรือประมาทเลินเล่อก็ตาม
          </p>
        </DisclosurePanel>
      </Disclosure>

      <hr class="my-5" />

      <Disclosure>
        <DisclosureButton class="disclosure-btn">
          <ChevronDownIcon class="size-6" />
          <h5 class="font-bold">
            การจำกัดความรับผิดชอบ ของ องค์กรต่อต้านคอร์รัปชัน (ประเทศไทย)
          </h5>
        </DisclosureButton>
        <DisclosurePanel class="disclosure-panel">
          <ul class="list-decimal ml-7 mb-3">
            <li>
              ผู้ใช้บริการยอมรับและตกลงว่าภายใต้ขอบเขตสูงสุดที่กฎหมายมีผลบังคับใช้อนุญาต
              องค์กรฯ ให้บริการเว็บไซต์บนพื้นฐาน “ตามที่เป็น” และ “ตามที่มี”
              โดยปราศจากการรับประกันใด ๆ รวมถึงการรับประกันโดยนัย
              หรือเงื่อนไขของความสามารถในการให้บริการ
              หรือความเหมาะสมของวัตถุประสงค์เฉพาะ องค์กรฯ
              ไม่รับรองหรือรับประกันว่า
              (1)เว็บไซต์จะตอบสนองความต้องการเฉพาะของผู้ใช้บริการหรือความคาดหวังของผู้ใช้บริการได้ทุกท่านและทุกส่วน
              (2)เว็บไซต์จะปราศจากไวรัส ข้อบกพร่องใด ๆ
              หรือจะสามารถใช้งานโดยปราศจากการสะดุด การล่าช้า
              หรือปราศจากช่วงเวลาที่เซิร์ฟเวอร์ล่มหรือความผิดปกติทางเทคนิคทั้งหมด
              (3)สารสนเทศ ข้อมูล
              หรือสื่อวัสดุที่แสดงหรือปรากฏในเว็บไซต์ทั้งหมดนั้นถูกต้อง แม่นยำ
              ครบถ้วน และเชื่อถือได้ เนื่องจากองค์กรฯ
              ดำเนินการเพียงการนำเสนอข้อมูลเท่านั้นไม่ได้เป็นเจ้าของหรือผู้ผลิตข้อมูลดังกล่าวโดยตรง
            </li>
            <li>
              ไม่ว่ากรณีใดที่องค์กรฯ ต้องรับผิดชอบ และรับผิดต่อผู้ใช้บริการ
              ภายใต้ข้อจำกัดที่องค์กรฯ กำหนดไว้ องค์กรฯ
              จะรับผิดชดใช้ค่าเสียหายให้แก่ผู้ใช้บริการ
              เฉพาะกรณีที่เกิดจากการกระทำโดยจงใจหรือประมาทเลินเล่ออย่างร้ายแรงขององค์กรฯ
              เท่านั้น โดยจะรับผิดชอบความเสียหายโดยตรงที่เกิดขึ้น
              เป็นจำนวนเงินสูงสุดไม่เกินกว่าค่าธรรมเนียมที่อาจเรียกเก็บจากผู้ใช้บริการ
              (ถ้ามี)
              โดยไม่รับผิดชอบสำหรับความเสียหายที่เกิดขึ้นอันมิใช่จากผลโดยตรงหรือค่าเสียหายในพฤติการณ์พิเศษ
            </li>
          </ul>
        </DisclosurePanel>
      </Disclosure>

      <hr class="my-5" />

      <Disclosure>
        <DisclosureButton class="disclosure-btn">
          <ChevronDownIcon class="size-6" />
          <h5 class="font-bold">การคุ้มครองทรัพย์สินทางปัญญา</h5>
        </DisclosureButton>
        <DisclosurePanel class="disclosure-panel">
          <p class="mb-3">
            สิทธิทรัพย์สินทางปัญญา กรรมสิทธิ์ และผลประโยชน์ทั้งหมดในบริการ
            โดยเฉพาะในส่วนที่เกี่ยวข้องกับเว็บไซต์ รวมถึงแต่ไม่จำกัดเพียง
            งานศิลปะ กราฟฟิก รูปภาพ แม่แบบ เว็บไซต์และวิดเจ็ต งานวรรณกรรม
            รหัสต้นฉบับ หรือ Object code คอมพิวเตอร์ Code (รวมถึง html)
            แอปพลิเคชัน เสียง เพลง วิดีโอและสื่ออื่น การออกแบบ แอนิเมชัน
            อินเทอร์เฟซ เอกสาร
            สิ่งประดิษฐ์ต่อยอดและการปรับปรุงเวอร์ชันของบริการดังกล่าว
            รูปลักษณ์และความรู้สึก (Mood and Tone) ของบริการ วิธีการ ผลิตภัณฑ์
            อัลกอริทึม ข้อมูล คุณลักษณะและวัตถุแบบโต้ตอบ
            เครื่องมือและวิธีการในการโฆษณา การได้มา สิ่งประดิษฐ์
            ความลับทางการค้า โลโก้ โดเมน URLs ที่กำหนดเอง เครื่องหมายการค้า
            เครื่องหมายบริการ ชื่อทางการค้า และสิ่งระบุกรรมสิทธิ์อื่นใด
            ไม่ว่าจะจดทะเบียนและ/หรือสามารถจดทะเบียนได้
            และที่มาของทรัพย์สินทางปัญญาใดนั้นเป็นของหรือเป็นสิทธิขององค์กรต่อต้านคอร์รัปชัน
            (ประเทศไทย) เพียงฝ่ายเดียว โดยองค์กรฯ
            สงวนสิทธิ์ทั้งปวงในการบังคับสิทธิในทรัพย์สินทางปัญญาของตนทั้งหมด
            ซึ่งรวมถึงแต่ไม่จำกัดเป็นการใช้สิทธิบังคับต่อการละเมิดสิทธิหรือเงื่อนไขการใช้ทรัพย์สินทางปัญญาโดยผู้ใช้บริการ
          </p>
        </DisclosurePanel>
      </Disclosure>

      <hr class="my-5" />

      <Disclosure>
        <DisclosureButton class="disclosure-btn">
          <ChevronDownIcon class="size-6" />
          <h5 class="font-bold">เงื่อนไขการให้สิทธิ (Licensing Term)</h5>
        </DisclosureButton>
        <DisclosurePanel class="disclosure-panel">
          <p class="mb-3">
            องค์กรต่อต้านคอร์รัปชัน (ประเทศไทย) ในฐานะผู้พัฒนาสร้างสรรค์
            และเจ้าของลิขสิทธิ์แต่เพียงฝ่ายเดียวของ (1)ข้อมูลทั้งหมดที่องค์กรฯ
            จัดทำและเปิดเผยผ่านเว็บไซต์ actai.co และ (2)Source Code ที่องค์กรฯ
            พัฒนาขึ้นเพื่อใช้วิเคราะห์และนำเสนอข้อมูล
            มีจุดประสงค์เปิดอนุญาตให้บุคคลทั่วไปใช้สิทธิในข้อมูล และ Source Code
            ดังกล่าวภายใต้เงื่อนไขที่ว่า ผู้ที่มีจุดประสงค์ใช้สิทธิในข้อมูลและ
            Source Code ดังกล่าวต้องใช้เพื่อประโยชน์สาธารณะเท่านั้น
            โดยต้องไม่นำข้อมูลและ Code
            ดังกล่าวไปใช้เพื่อจุดประสงค์อื่นโดยเฉพาะการใช้ในเชิงพาณิชย์
            <br /><br />
            ทั้งนี้เพื่อหลีกเลี่ยงข้อสงสัย การใช้ประโยชน์เชิงพาณิชย์
            อาจหมายความรวมถึงแต่ไม่จำกัดเพียง การนำข้อมูลหรือ Code
            ดังกล่าวไปเพื่อการขายงาน หรือการแสวงหารายได้ไม่ว่าในลักษณะใด
            หากผู้ใช้บริการมีข้อสงสัยเกี่ยวกับการใช้ประโยชน์
            ท่านสามารถติดต่อมายังองค์กรต่อต้านคอร์รัปชัน (ประเทศไทย)
            เพื่อความชัดเจน
            <br /><br />
            หากองค์กรฯ ตรวจสอบพบการใช้งานของข้อมูลหรือ Code
            ที่ไม่ถูกต้องสอดคล้องกับเงื่อนไขที่องค์กรฯ กำหนดไว้ องค์กรฯ
            ขอสงวนสิทธิ์ในการดำเนินการทางกฎหมายต่อผู้ใช้บริการที่ละเมิดเงื่อนไขในทันที
          </p>
        </DisclosurePanel>
      </Disclosure>

      <hr class="my-5" />

      <Disclosure>
        <DisclosureButton class="disclosure-btn">
          <ChevronDownIcon class="size-6" />
          <h5 class="font-bold">ติดต่อเรา</h5>
        </DisclosureButton>
        <DisclosurePanel class="disclosure-panel">
          <p class="mb-3">
            หากมีคำถามเกี่ยวกับข้อกำหนดและเงื่อนไข กรุณาติดต่อ:
            <a
              href="mailto:act@anticorruption.in.th"
              class="text-[#0B5C90] underline"
              >act@anticorruption.in.th</a
            >
          </p>
        </DisclosurePanel>
      </Disclosure>

      <hr class="my-5" />
    </ClientOnly>
  </div>
  <Footer />
</template>

<script setup>
import { Disclosure, DisclosureButton, DisclosurePanel } from '@headlessui/vue';
import { ChevronDownIcon } from '@heroicons/vue/24/solid';

const mockdata = ref([
  {
    name: 'ข้อมูลโครงการจัดซื้อจัดจ้างภาครัฐ',
    list: [
      {
        name: 'เข้าถึงจาก ระบบการจัดซื้อจัดจ้างภาครัฐ',
        link: 'http://www.gprocurement.go.th',
      },
      {
        name: 'เข้าถึงจาก ระบบข้อมูลการใช้จ่ายภาครัฐ “ภาษีไปไหน?” ',
        link: 'http://www.govspending.data.go.th',
      },
    ],
  },
  {
    name: 'ข้อมูลนิติบุคคล',
    list: [
      {
        name: 'เข้าถึงจาก DBD DataWarehouse+',
        link: 'https://datawarehouse.dbd.go.th',
      },
    ],
  },
  {
    name: 'ข้อมูลบัญชีทรัพย์สินและหนี้สินของผู้ดำรงตำแหน่งทางการเมืองและข้าราชการระดับสูง',
    list: [
      {
        name: 'เข้าถึงได้จาก ระบบการยื่นบัญชีแสดงรายการทรัพย์สินและหนี้สิน',
        link: 'https://asset.nacc.go.th/dcs-app',
      },
    ],
  },
  {
    name: 'ข้อมูลเงินบริจาคพรรคการเมือง',
    list: [
      {
        name: 'เข้าถึงได้จาก',
        link: 'https://www.ect.go.th/ect_th/th/db_119_ect_th_download_22',
      },
    ],
  },
  {
    name: 'ข้อมูลดิจิทัลคำชี้มูลความผิดของ สำนักงานคณะกรรมการป้องกันและปราบปรามการทุจริตแห่งชาติ',
    list: [
      {
        name: 'เข้าถึงได้จาก',
        link: 'https://www.nacc.go.th/naccCulIncul/naccCulpability.php',
      },
    ],
  },
  {
    name: 'ข้อมูลคำพิพากษาศาลฎีกาแผนกคดีอาญาของผู้ดำรงตำแหน่งทางการเมือง',
    list: [
      {
        name: 'เข้าถึงได้จาก',
        link: 'http://www.supremecourt.or.th/division/แผนกคดีอาญาของผู้ดำรงตำแหน่งทางการเมือง/คำพิพากษาคดี',
      },
    ],
  },
  {
    name: 'ข้อมูลการบังคับใช้กฎหมายของ สำนักงานคณะกรรมการกำกับหลักทรัพย์และตลาดหลักทรัพย์',
    list: [
      {
        name: 'เข้าถึงได้จาก',
        link: 'https://market.sec.or.th/public/idisc/th/Enforce',
      },
    ],
  },
  {
    name: 'ข้อมูลรายชื่อผู้บริหารกระทรวงและข้าราชการระดับสูง',
    list: [
      {
        name: 'เข้าถึงได้จาก ราชกิจจานุเบกษา',
        link: 'https://ratchakitcha.soc.go.th/',
      },
    ],
  },
  {
    name: 'ข้อบัญญัติงบประมาณรายจ่ายประจำปีขององค์การบริหารส่วนจังหวัด',
    list: [
      {
        name: 'เข้าถึงได้จาก เว็บไซต์ขององค์การบริหารส่วนจังหวัด 76 แห่ง',
        link: '',
      },
    ],
  },
]);
</script>
